99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/uart/esp32_mquickjs_uart.c
#include "esp32_mquickjs_uart.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_UART

#include "utils/esp32_mquickjs_byte_source.h"
#include "esp32_mquickjs_core.h"

#include <limits.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "driver/gpio.h"
#include "driver/uart.h"
#include "esp_err.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "soc/soc_caps.h"

typedef struct {
    int32_t port_id;
    uint32_t generation;
} esp32_mquickjs_uart_port_ref_t;

typedef struct {
    bool allocated;
    int32_t port_id;
    uint32_t generation;
    int32_t tx_pin;
    int32_t rx_pin;
    uint32_t baud;
    uart_word_length_t data_bits;
    uart_parity_t parity;
    uart_stop_bits_t stop_bits;
    uint32_t rx_buffer_size;
    uint32_t tx_buffer_size;
    uint32_t timeout_ms;
} esp32_mquickjs_uart_slot_t;

static esp32_mquickjs_uart_slot_t s_uart_slots[SOC_UART_NUM];
static uint32_t s_uart_next_generation = 1;

static bool js_value_to_i32(JSContext *ctx, JSValue value, int32_t *out_value)
{
    int raw_value = 0;

    if (JS_ToInt32(ctx, &raw_value, value) != 0) {
        return false;
    }
    *out_value = (int32_t)raw_value;
    return true;
}

static bool js_value_to_u32(JSContext *ctx, JSValue value, uint32_t *out_value)
{
    int raw_value = 0;

    if (JS_ToInt32(ctx, &raw_value, value) != 0 || raw_value < 0) {
        return false;
    }
    *out_value = (uint32_t)raw_value;
    return true;
}

static bool js_value_to_uart_port(JSContext *ctx, JSValue value, int32_t *out_port)
{
    int32_t port = -1;

    if (!js_value_to_i32(ctx, value, &port) || port < 0 || port >= (int32_t)SOC_UART_NUM) {
        return false;
    }
    *out_port = port;
    return true;
}

static bool js_value_to_gpio_num(JSContext *ctx, JSValue value, int32_t *out_pin)
{
    int32_t pin = -1;

    if (!js_value_to_i32(ctx, value, &pin)) {
        return false;
    }
    if (pin == -1) {
        *out_pin = -1;
        return true;
    }
    if (pin < 0 || pin >= GPIO_NUM_MAX || !GPIO_IS_VALID_GPIO(pin)) {
        return false;
    }

    *out_pin = pin;
    return true;
}

static bool js_value_to_uart_data_bits(JSContext *ctx, JSValue value, uart_word_length_t *out_data_bits)
{
    int32_t bits = 0;

    if (!js_value_to_i32(ctx, value, &bits)) {
        return false;
    }

    switch (bits) {
    case 5:
        *out_data_bits = UART_DATA_5_BITS;
        return true;
    case 6:
        *out_data_bits = UART_DATA_6_BITS;
        return true;
    case 7:
        *out_data_bits = UART_DATA_7_BITS;
        return true;
    case 8:
        *out_data_bits = UART_DATA_8_BITS;
        return true;
    default:
        return false;
    }
}

static int32_t uart_data_bits_to_number(uart_word_length_t data_bits)
{
    switch (data_bits) {
    case UART_DATA_5_BITS:
        return 5;
    case UART_DATA_6_BITS:
        return 6;
    case UART_DATA_7_BITS:
        return 7;
    case UART_DATA_8_BITS:
    default:
        return 8;
    }
}

static bool js_value_to_uart_parity(JSContext *ctx, JSValue value, uart_parity_t *out_parity)
{
    JSCStringBuf parity_buf;
    const char *parity;

    if (!JS_IsString(ctx, value)) {
        return false;
    }

    parity = JS_ToCString(ctx, value, &parity_buf);
    if (parity == NULL) {
        return false;
    }

    if (strcmp(parity, "none") == 0) {
        *out_parity = UART_PARITY_DISABLE;
        return true;
    }
    if (strcmp(parity, "even") == 0) {
        *out_parity = UART_PARITY_EVEN;
        return true;
    }
    if (strcmp(parity, "odd") == 0) {
        *out_parity = UART_PARITY_ODD;
        return true;
    }
    return false;
}

static const char *uart_parity_to_string(uart_parity_t parity)
{
    switch (parity) {
    case UART_PARITY_EVEN:
        return "even";
    case UART_PARITY_ODD:
        return "odd";
    case UART_PARITY_DISABLE:
    default:
        return "none";
    }
}

static bool js_value_to_uart_stop_bits(JSContext *ctx, JSValue value, uart_stop_bits_t *out_stop_bits)
{
    double stop_bits = 0.0;

    if (JS_ToNumber(ctx, &stop_bits, value) != 0) {
        return false;
    }

    if (stop_bits == 1.0) {
        *out_stop_bits = UART_STOP_BITS_1;
        return true;
    }
    if (stop_bits == 1.5) {
        *out_stop_bits = UART_STOP_BITS_1_5;
        return true;
    }
    if (stop_bits == 2.0) {
        *out_stop_bits = UART_STOP_BITS_2;
        return true;
    }
    return false;
}

static JSValue uart_stop_bits_to_value(JSContext *ctx, uart_stop_bits_t stop_bits)
{
    switch (stop_bits) {
    case UART_STOP_BITS_1_5:
        return JS_NewFloat64(ctx, 1.5);
    case UART_STOP_BITS_2:
        return JS_NewInt32(ctx, 2);
    case UART_STOP_BITS_1:
    default:
        return JS_NewInt32(ctx, 1);
    }
}

static JSValue uart_throw_error(JSContext *ctx,
                                esp_err_t err,
                                const char *message)
{
    return JS_ThrowInternalError(ctx, "%s: %s", message, esp_err_to_name(err));
}

static void uart_init_slot(esp32_mquickjs_uart_slot_t *slot, int32_t port_id)
{
    memset(slot, 0, sizeof(*slot));
    slot->port_id = port_id;
}

static void uart_reset_slots(void)
{
    int32_t i;

    for (i = 0; i < (int32_t)SOC_UART_NUM; ++i) {
        uart_init_slot(&s_uart_slots[i], i);
    }
    s_uart_next_generation = 1;
}

static uint32_t uart_take_generation(void)
{
    uint32_t generation = s_uart_next_generation++;

    if (generation == 0) {
        generation = s_uart_next_generation++;
    }
    return generation;
}

static esp32_mquickjs_uart_slot_t *uart_alloc_slot(int32_t port_id)
{
    esp32_mquickjs_uart_slot_t *slot;

    if (port_id < 0 || port_id >= (int32_t)SOC_UART_NUM) {
        return NULL;
    }

    slot = &s_uart_slots[port_id];
    if (slot->allocated || uart_is_driver_installed((uart_port_t)port_id)) {
        return NULL;
    }

    uart_init_slot(slot, port_id);
    slot->allocated = true;
    slot->generation = uart_take_generation();
    return slot;
}

static void uart_cleanup_slot(esp32_mquickjs_uart_slot_t *slot)
{
    int32_t port_id;

    if (slot == NULL || !slot->allocated) {
        return;
    }

