99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/uart/esp32_mquickjs_uart.c
    port_id = slot->port_id;
    if (uart_is_driver_installed((uart_port_t)port_id)) {
        uart_driver_delete((uart_port_t)port_id);
    }
    uart_init_slot(slot, port_id);
}

static esp32_mquickjs_uart_slot_t *uart_get_slot(const esp32_mquickjs_uart_port_ref_t *ref)
{
    esp32_mquickjs_uart_slot_t *slot;

    if (ref == NULL || ref->port_id < 0 || ref->port_id >= (int32_t)SOC_UART_NUM) {
        return NULL;
    }

    slot = &s_uart_slots[ref->port_id];
    if (!slot->allocated || slot->generation != ref->generation) {
        return NULL;
    }
    return slot;
}

static JSValue uart_bytes_to_array(JSContext *ctx, const uint8_t *bytes, size_t length)
{
    JSGCRef array_ref;
    JSValue *array_obj;
    uint32_t i;

    array_obj = JS_PushGCRef(ctx, &array_ref);
    *array_obj = JS_NewArray(ctx, 0);
    if (JS_IsException(*array_obj)) {
        JS_PopGCRef(ctx, &array_ref);
        return JS_EXCEPTION;
    }

    for (i = 0; i < length; ++i) {
        if (JS_IsException(JS_SetPropertyUint32(ctx, *array_obj, i, JS_NewInt32(ctx, bytes[i])))) {
            JS_PopGCRef(ctx, &array_ref);
            return JS_EXCEPTION;
        }
    }

    return JS_PopGCRef(ctx, &array_ref);
}

static JSValue uart_make_write_stats(JSContext *ctx,
                                     uint32_t chunks,
                                     size_t bytes,
                                     uint64_t total_us)
{
    JSGCRef stats_ref;
    JSValue *stats;

    stats = JS_PushGCRef(ctx, &stats_ref);
    *stats = JS_NewObject(ctx);
    if (JS_IsException(*stats)) {
        JS_PopGCRef(ctx, &stats_ref);
        return JS_EXCEPTION;
    }

    if (!esp32_mquickjs_set_property(ctx, *stats, "chunks", JS_NewUint32(ctx, chunks)) ||
        !esp32_mquickjs_set_property(ctx, *stats, "bytes", JS_NewInt64(ctx, (int64_t)bytes)) ||
        !esp32_mquickjs_set_property(ctx, *stats, "totalUs", JS_NewInt64(ctx, (int64_t)total_us))) {
        JS_PopGCRef(ctx, &stats_ref);
        return JS_EXCEPTION;
    }

    return JS_PopGCRef(ctx, &stats_ref);
}

static JSValue uart_make_status_object(JSContext *ctx, const esp32_mquickjs_uart_slot_t *slot)
{
    JSGCRef status_ref;
    JSValue *status_obj;
    JSValue stop_bits_value = JS_UNDEFINED;

    status_obj = JS_PushGCRef(ctx, &status_ref);
    *status_obj = JS_NewObject(ctx);
    if (JS_IsException(*status_obj)) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }

    stop_bits_value = uart_stop_bits_to_value(ctx, slot != NULL ? slot->stop_bits : UART_STOP_BITS_1);
    if (JS_IsException(stop_bits_value) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "opened",
                                     JS_NewBool(slot != NULL && slot->allocated)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "port",
                                     JS_NewInt32(ctx, slot != NULL ? slot->port_id : ESP32_MQUICKJS_UART_DEFAULT_PORT)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "tx",
                                     JS_NewInt32(ctx, slot != NULL ? slot->tx_pin : ESP32_MQUICKJS_UART_DEFAULT_TX_PIN)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "rx",
                                     JS_NewInt32(ctx, slot != NULL ? slot->rx_pin : ESP32_MQUICKJS_UART_DEFAULT_RX_PIN)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "baud",
                                     JS_NewUint32(ctx, slot != NULL ? slot->baud : ESP32_MQUICKJS_UART_DEFAULT_BAUD)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "dataBits",
                                     JS_NewInt32(ctx, slot != NULL ? uart_data_bits_to_number(slot->data_bits) : 8)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "parity",
                                     JS_NewString(ctx, slot != NULL ? uart_parity_to_string(slot->parity) : "none")) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "stopBits", stop_bits_value) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "rxBufferSize",
                                     JS_NewUint32(ctx, slot != NULL ? slot->rx_buffer_size : ESP32_MQUICKJS_UART_DEFAULT_RX_BUFFER_SIZE)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "txBufferSize",
                                     JS_NewUint32(ctx, slot != NULL ? slot->tx_buffer_size : ESP32_MQUICKJS_UART_DEFAULT_TX_BUFFER_SIZE)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "timeoutMs",
                                     JS_NewUint32(ctx, slot != NULL ? slot->timeout_ms : ESP32_MQUICKJS_UART_DEFAULT_TIMEOUT_MS))) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }

    return JS_PopGCRef(ctx, &status_ref);
}

static JSValue uart_make_port_object(JSContext *ctx, const esp32_mquickjs_uart_slot_t *slot)
{
    JSGCRef port_ref;
    JSValue *port_obj;
    esp32_mquickjs_uart_port_ref_t *port_data;

    port_obj = JS_PushGCRef(ctx, &port_ref);
    *port_obj = JS_NewObjectClassUser(ctx, JS_CLASS_UART_PORT);
    if (JS_IsException(*port_obj) || slot == NULL) {
        JS_PopGCRef(ctx, &port_ref);
        return JS_EXCEPTION;
    }

    port_data = heap_caps_malloc(sizeof(*port_data), MALLOC_CAP_8BIT);
    if (port_data == NULL) {
        JS_PopGCRef(ctx, &port_ref);
        return JS_ThrowOutOfMemory(ctx);
    }
    port_data->port_id = slot->port_id;
    port_data->generation = slot->generation;
    JS_SetOpaque(ctx, *port_obj, port_data);

    return JS_PopGCRef(ctx, &port_ref);
}

static int uart_port_ref_from_object(JSContext *ctx,
                                     JSValue port_value,
                                     const char *api_name,
                                     esp32_mquickjs_uart_port_ref_t *out_ref)
{
    const esp32_mquickjs_uart_port_ref_t *port_ref;

    if (out_ref == NULL || JS_GetClassID(ctx, port_value) != JS_CLASS_UART_PORT) {
        JS_ThrowTypeError(ctx, "%s expects a valid UARTPort instance", api_name);
        return -1;
    }
    port_ref = JS_GetOpaque(ctx, port_value);
    if (port_ref == NULL) {
        JS_ThrowTypeError(ctx, "%s expects a valid UARTPort instance", api_name);
        return -1;
    }
    *out_ref = *port_ref;
    return 0;
}

static int uart_get_bound_slot(JSContext *ctx,
                               JSValue port_value,
                               const char *api_name,
                               esp32_mquickjs_uart_port_ref_t *out_ref,
                               esp32_mquickjs_uart_slot_t **out_slot)
{
    esp32_mquickjs_uart_slot_t *slot;

    if (uart_port_ref_from_object(ctx, port_value, api_name, out_ref) != 0) {
        return -1;
    }
    slot = uart_get_slot(out_ref);
    if (slot == NULL) {
        JS_ThrowReferenceError(ctx, "%s failed because the UART port is closed", api_name);
        return -1;
    }
    if (out_slot != NULL) {
        *out_slot = slot;
    }
    return 0;
}

static TickType_t uart_timeout_ticks(uint32_t timeout_ms)
{
    return pdMS_TO_TICKS(timeout_ms);
}

static JSValue uart_write_bytes_from_source(JSContext *ctx,
                                            const esp32_mquickjs_uart_slot_t *slot,
                                            const uint8_t *data,
                                            size_t length,
                                            const char *api_name)
{
    int written;

    if (length == 0) {
        return JS_NewInt32(ctx, 0);
    }
    if (data == NULL) {
        return JS_ThrowInternalError(ctx, "%s received non-empty byte source with null data", api_name);
    }
    if (length > INT_MAX) {
        return JS_ThrowRangeError(ctx, "%s byte length exceeds supported UART write size", api_name);
    }

