99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/uart/esp32_mquickjs_uart.c
    written = uart_write_bytes((uart_port_t)slot->port_id, data, length);
    if (written < 0) {
        return JS_ThrowInternalError(ctx, "%s failed", api_name);
    }
    return JS_NewInt32(ctx, written);
}

static JSValue uart_write(JSContext *ctx,
                          const esp32_mquickjs_uart_slot_t *slot,
                          JSValue data_value)
{
    esp32_mquickjs_byte_source_t source;
    uint8_t *owned = NULL;
    JSValue error = JS_UNDEFINED;
    JSValue result;

    if (!esp32_mquickjs_get_byte_source(ctx, data_value, "UARTPort.write(data)", &source, &owned, &error)) {
        return error;
    }

    result = uart_write_bytes_from_source(ctx, slot, source.data, source.length, "UARTPort.write()");
    esp32_mquickjs_release_byte_source(owned);
    return result;
}

static JSValue uart_write_chunks(JSContext *ctx,
                                 const esp32_mquickjs_uart_slot_t *slot,
                                 JSValue chunks_value)
{
    uint32_t chunk_count = 0;
    uint32_t chunks = 0;
    uint32_t index;
    size_t bytes = 0;
    int64_t total_start;
    JSValue error = JS_UNDEFINED;

    if (!esp32_mquickjs_get_byte_source_array_length(ctx,
                                                     chunks_value,
                                                     "UARTPort.writeChunks(chunks)",
                                                     &chunk_count,
                                                     &error)) {
        return JS_IsUndefined(error)
                   ? JS_ThrowTypeError(ctx, "UARTPort.writeChunks(chunks) expects an array-like object")
                   : error;
    }

    total_start = esp_timer_get_time();
    for (index = 0; index < chunk_count; ++index) {
        esp32_mquickjs_byte_source_chunk_t chunk;
        int written;

        if (!esp32_mquickjs_get_byte_source_chunk(ctx,
                                                  chunks_value,
                                                  index,
                                                  "UARTPort.writeChunks(chunks)",
                                                  &chunk,
                                                  &error)) {
            return JS_IsUndefined(error)
                       ? JS_ThrowTypeError(ctx, "UARTPort.writeChunks(chunks) expects byte-source chunks")
                       : error;
        }
        if (chunk.source.length == 0) {
            esp32_mquickjs_release_byte_source_chunk(ctx, &chunk);
            continue;
        }
        if (chunk.source.length > INT_MAX) {
            esp32_mquickjs_release_byte_source_chunk(ctx, &chunk);
            return JS_ThrowRangeError(ctx, "UARTPort.writeChunks(chunks) byte length exceeds supported UART write size");
        }
        written = uart_write_bytes((uart_port_t)slot->port_id, chunk.source.data, chunk.source.length);
        if (written < 0) {
            esp32_mquickjs_release_byte_source_chunk(ctx, &chunk);
            return JS_ThrowInternalError(ctx, "UARTPort.writeChunks() failed");
        }
        bytes += (size_t)written;
        chunks++;
        esp32_mquickjs_release_byte_source_chunk(ctx, &chunk);
    }

    return uart_make_write_stats(ctx,
                                 chunks,
                                 bytes,
                                 (uint64_t)(esp_timer_get_time() - total_start));
}

static JSValue uart_write_span_source(JSContext *ctx,
                                      const esp32_mquickjs_uart_slot_t *slot,
                                      JSValue source_value)
{
    esp32_mquickjs_byte_span_source_t source;
    uint32_t chunks = 0;
    size_t bytes = 0;
    int64_t total_start;
    JSValue error = JS_UNDEFINED;

    if (!esp32_mquickjs_open_byte_span_source(ctx,
                                              source_value,
                                              "UARTPort.writeSource(source)",
                                              &source,
                                              &error)) {
        return JS_IsUndefined(error)
                   ? JS_ThrowTypeError(ctx, "UARTPort.writeSource(source) expects a ByteSpanSource")
                   : error;
    }

    total_start = esp_timer_get_time();
    while (true) {
        esp32_mquickjs_byte_span_t span;
        int written;

        if (!esp32_mquickjs_byte_span_source_next(ctx, &source, &span)) {
            error = JS_GetException(ctx);
            if (!JS_IsUndefined(error) && !JS_IsNull(error)) {
                esp32_mquickjs_byte_span_source_close(ctx, &source);
                return error;
            }
            break;
        }
        if (span.length == 0) {
            continue;
        }
        if (span.data == NULL) {
            esp32_mquickjs_byte_span_source_close(ctx, &source);
            return JS_ThrowInternalError(ctx, "UARTPort.writeSource() received a non-empty span with null data");
        }
        if (span.length > INT_MAX) {
            esp32_mquickjs_byte_span_source_close(ctx, &source);
            return JS_ThrowRangeError(ctx, "UARTPort.writeSource() span length exceeds supported UART write size");
        }
        written = uart_write_bytes((uart_port_t)slot->port_id, span.data, span.length);
        if (written < 0) {
            esp32_mquickjs_byte_span_source_close(ctx, &source);
            return JS_ThrowInternalError(ctx, "UARTPort.writeSource() failed");
        }
        bytes += (size_t)written;
        chunks++;
    }

    esp32_mquickjs_byte_span_source_close(ctx, &source);
    return uart_make_write_stats(ctx,
                                 chunks,
                                 bytes,
                                 (uint64_t)(esp_timer_get_time() - total_start));
}

static JSValue uart_read(JSContext *ctx,
                         const esp32_mquickjs_uart_slot_t *slot,
                         uint32_t length,
                         uint32_t timeout_ms)
{
    uint8_t *bytes = NULL;
    int read_len;
    JSValue result;

    if (length == 0) {
        return JS_NewArray(ctx, 0);
    }

    bytes = heap_caps_malloc(length, MALLOC_CAP_8BIT);
    if (bytes == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }

    read_len = uart_read_bytes((uart_port_t)slot->port_id,
                               bytes,
                               length,
                               uart_timeout_ticks(timeout_ms));
    if (read_len < 0) {
        heap_caps_free(bytes);
        return JS_ThrowInternalError(ctx, "UARTPort.read() failed");
    }

    result = uart_bytes_to_array(ctx, bytes, (size_t)read_len);
    heap_caps_free(bytes);
    return result;
}

