99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/uart/esp32_mquickjs_uart.c
static JSValue uart_open(JSContext *ctx, int argc, JSValue *argv)
{
    int32_t port_id = ESP32_MQUICKJS_UART_DEFAULT_PORT;
    int32_t tx_pin = ESP32_MQUICKJS_UART_DEFAULT_TX_PIN;
    int32_t rx_pin = ESP32_MQUICKJS_UART_DEFAULT_RX_PIN;
    uint32_t baud = ESP32_MQUICKJS_UART_DEFAULT_BAUD;
    uart_word_length_t data_bits = UART_DATA_8_BITS;
    uart_parity_t parity = UART_PARITY_DISABLE;
    uart_stop_bits_t stop_bits = UART_STOP_BITS_1;
    uint32_t rx_buffer_size = ESP32_MQUICKJS_UART_DEFAULT_RX_BUFFER_SIZE;
    uint32_t tx_buffer_size = ESP32_MQUICKJS_UART_DEFAULT_TX_BUFFER_SIZE;
    uint32_t timeout_ms = ESP32_MQUICKJS_UART_DEFAULT_TIMEOUT_MS;
    uart_config_t uart_config = {0};
    esp32_mquickjs_uart_slot_t *slot;
    JSValue result;
    esp_err_t err;

    if (argc >= 1 && !JS_IsUndefined(argv[0])) {
        JSGCRef property_ref;
        JSValue *property;

        if (JS_GetClassID(ctx, argv[0]) < 0) {
            return JS_ThrowTypeError(ctx,
                                     "uart.open(options?) expects an object with port/tx/rx/baud/dataBits/parity/stopBits");
        }

        property = JS_PushGCRef(ctx, &property_ref);

        *property = JS_GetPropertyStr(ctx, argv[0], "port");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_uart_port(ctx, *property, &port_id)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "uart.open({ port }) expects a valid UART port number");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "tx");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_gpio_num(ctx, *property, &tx_pin)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "uart.open({ tx }) expects a valid GPIO or -1");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "rx");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_gpio_num(ctx, *property, &rx_pin)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "uart.open({ rx }) expects a valid GPIO or -1");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "baud");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) &&
            (!js_value_to_u32(ctx, *property, &baud) || baud == 0U)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "uart.open({ baud }) expects a positive integer");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "dataBits");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_uart_data_bits(ctx, *property, &data_bits)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "uart.open({ dataBits }) expects 5, 6, 7, or 8");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "parity");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_uart_parity(ctx, *property, &parity)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "uart.open({ parity }) expects \"none\", \"even\", or \"odd\"");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "stopBits");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_uart_stop_bits(ctx, *property, &stop_bits)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "uart.open({ stopBits }) expects 1, 1.5, or 2");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "rxBufferSize");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_u32(ctx, *property, &rx_buffer_size)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "uart.open({ rxBufferSize }) expects a non-negative integer");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "txBufferSize");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_u32(ctx, *property, &tx_buffer_size)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "uart.open({ txBufferSize }) expects a non-negative integer");
        }

        *property = JS_GetPropertyStr(ctx, argv[0], "timeoutMs");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !js_value_to_u32(ctx, *property, &timeout_ms)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowTypeError(ctx, "uart.open({ timeoutMs }) expects a non-negative integer");
        }

        JS_PopGCRef(ctx, &property_ref);
    }

    if (tx_pin < 0 && rx_pin < 0) {
        return JS_ThrowTypeError(ctx, "uart.open() requires a TX or RX GPIO");
    }
    if (tx_pin >= 0 && !GPIO_IS_VALID_OUTPUT_GPIO(tx_pin)) {
        return JS_ThrowTypeError(ctx, "uart.open() requires TX to be an output-capable GPIO or -1");
    }
    if (rx_pin >= 0 && !GPIO_IS_VALID_GPIO(rx_pin)) {
        return JS_ThrowTypeError(ctx, "uart.open() requires RX to be a valid GPIO or -1");
    }
    if (rx_buffer_size <= UART_HW_FIFO_LEN((uart_port_t)port_id)) {
        return JS_ThrowTypeError(ctx, "uart.open({ rxBufferSize }) must be greater than the UART hardware FIFO length");
    }
    if (tx_buffer_size != 0U && tx_buffer_size <= UART_HW_FIFO_LEN((uart_port_t)port_id)) {
        return JS_ThrowTypeError(ctx, "uart.open({ txBufferSize }) must be zero or greater than the UART hardware FIFO length");
    }
#if defined(CONFIG_ESP_CONSOLE_UART_NUM) && CONFIG_ESP_CONSOLE_UART_NUM >= 0
    if (port_id == CONFIG_ESP_CONSOLE_UART_NUM) {
        return JS_ThrowInternalError(ctx, "uart.open() refused to take the console UART port");
    }
#endif

