99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/uart/esp32_mquickjs_uart.c
    slot = uart_alloc_slot(port_id);
    if (slot == NULL) {
        return JS_ThrowInternalError(ctx, "uart.open() failed: selected UART port is unavailable or already in use");
    }

    uart_config.baud_rate = (int)baud;
    uart_config.data_bits = data_bits;
    uart_config.parity = parity;
    uart_config.stop_bits = stop_bits;
    uart_config.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;
    uart_config.rx_flow_ctrl_thresh = 0;
    uart_config.source_clk = UART_SCLK_DEFAULT;

    err = uart_param_config((uart_port_t)port_id, &uart_config);
    if (err != ESP_OK) {
        uart_cleanup_slot(slot);
        return uart_throw_error(ctx, err, "uart.open() failed to configure parameters");
    }

    err = uart_set_pin((uart_port_t)port_id,
                       tx_pin,
                       rx_pin,
                       UART_PIN_NO_CHANGE,
                       UART_PIN_NO_CHANGE);
    if (err != ESP_OK) {
        uart_cleanup_slot(slot);
        return uart_throw_error(ctx, err, "uart.open() failed to configure pins");
    }

    err = uart_driver_install((uart_port_t)port_id,
                              (int)rx_buffer_size,
                              (int)tx_buffer_size,
                              0,
                              NULL,
                              0);
    if (err != ESP_OK) {
        uart_cleanup_slot(slot);
        return uart_throw_error(ctx, err, "uart.open() failed to install driver");
    }

    slot->tx_pin = tx_pin;
    slot->rx_pin = rx_pin;
    slot->baud = baud;
    slot->data_bits = data_bits;
    slot->parity = parity;
    slot->stop_bits = stop_bits;
    slot->rx_buffer_size = rx_buffer_size;
    slot->tx_buffer_size = tx_buffer_size;
    slot->timeout_ms = timeout_ms;

    result = uart_make_port_object(ctx, slot);
    if (JS_IsException(result)) {
        uart_cleanup_slot(slot);
    }
    return result;
}

void esp32_mquickjs_init_uart_runtime(void)
{
    int32_t i;

    for (i = 0; i < (int32_t)SOC_UART_NUM; ++i) {
        if (s_uart_slots[i].allocated) {
            uart_cleanup_slot(&s_uart_slots[i]);
        }
    }
    uart_reset_slots();
}

JSValue js_uart_port_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "UARTPort cannot be constructed directly");
}

void js_uart_port_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_uart_port_ref_t *port_ref = opaque;
    esp32_mquickjs_uart_slot_t *slot;

    (void)ctx;

    if (port_ref == NULL) {
        return;
    }

    slot = uart_get_slot(port_ref);
    if (slot != NULL) {
        uart_cleanup_slot(slot);
    }
    heap_caps_free(port_ref);
}

JSValue js_uart_port_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_uart_port_ref_t port_ref;
    esp32_mquickjs_uart_port_ref_t *port_ref_ptr;
    esp32_mquickjs_uart_slot_t *slot;

    (void)argc;
    (void)argv;

    if (uart_port_ref_from_object(ctx, *this_val, "UARTPort.close()", &port_ref) != 0) {
        return JS_EXCEPTION;
    }
    slot = uart_get_slot(&port_ref);
    if (slot != NULL) {
        uart_cleanup_slot(slot);
    }
    port_ref_ptr = JS_GetOpaque(ctx, *this_val);
    if (port_ref_ptr != NULL) {
        port_ref_ptr->port_id = -1;
        port_ref_ptr->generation = 0;
    }
    return JS_TRUE;
}

JSValue js_uart_port_status(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_uart_port_ref_t port_ref;
    esp32_mquickjs_uart_slot_t *slot = NULL;

    (void)argc;
    (void)argv;

    if (uart_get_bound_slot(ctx, *this_val, "UARTPort.status()", &port_ref, &slot) != 0) {
        return JS_EXCEPTION;
    }
    return uart_make_status_object(ctx, slot);
}

JSValue js_uart_port_write(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_uart_port_ref_t port_ref;
    esp32_mquickjs_uart_slot_t *slot = NULL;

    if (uart_get_bound_slot(ctx, *this_val, "UARTPort.write()", &port_ref, &slot) != 0) {
        return JS_EXCEPTION;
    }
    if (argc < 1) {
        return JS_ThrowTypeError(ctx, "UARTPort.write(data) expects byte data");
    }
    return uart_write(ctx, slot, argv[0]);
}

JSValue js_uart_port_write_chunks(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_uart_port_ref_t port_ref;
    esp32_mquickjs_uart_slot_t *slot = NULL;

    if (uart_get_bound_slot(ctx, *this_val, "UARTPort.writeChunks()", &port_ref, &slot) != 0) {
        return JS_EXCEPTION;
    }
    if (argc < 1) {
        return JS_ThrowTypeError(ctx, "UARTPort.writeChunks(chunks) expects byte-source chunks");
    }
    return uart_write_chunks(ctx, slot, argv[0]);
}

JSValue js_uart_port_write_source(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_uart_port_ref_t port_ref;
    esp32_mquickjs_uart_slot_t *slot = NULL;

    if (uart_get_bound_slot(ctx, *this_val, "UARTPort.writeSource()", &port_ref, &slot) != 0) {
        return JS_EXCEPTION;
    }
    if (argc < 1) {
        return JS_ThrowTypeError(ctx, "UARTPort.writeSource(source) expects a ByteSpanSource");
    }
    return uart_write_span_source(ctx, slot, argv[0]);
}

JSValue js_uart_port_read(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_uart_port_ref_t port_ref;
    esp32_mquickjs_uart_slot_t *slot = NULL;
    uint32_t length = 0;
    uint32_t timeout_ms;

    if (uart_get_bound_slot(ctx, *this_val, "UARTPort.read()", &port_ref, &slot) != 0) {
        return JS_EXCEPTION;
    }
    if (argc < 1 || !js_value_to_u32(ctx, argv[0], &length)) {
        return JS_ThrowTypeError(ctx, "UARTPort.read(length, timeoutMs?) expects a byte length");
    }
    timeout_ms = slot->timeout_ms;
    if (argc >= 2 && !JS_IsUndefined(argv[1]) && !js_value_to_u32(ctx, argv[1], &timeout_ms)) {
        return JS_ThrowTypeError(ctx, "UARTPort.read(length, timeoutMs?) expects timeoutMs to be non-negative");
    }
    return uart_read(ctx, slot, length, timeout_ms);
}

JSValue js_uart_port_available(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_uart_port_ref_t port_ref;
    esp32_mquickjs_uart_slot_t *slot = NULL;
    size_t available = 0;
    esp_err_t err;

    (void)argc;
    (void)argv;

    if (uart_get_bound_slot(ctx, *this_val, "UARTPort.available()", &port_ref, &slot) != 0) {
        return JS_EXCEPTION;
    }
    err = uart_get_buffered_data_len((uart_port_t)slot->port_id, &available);
    if (err != ESP_OK) {
        return uart_throw_error(ctx, err, "UARTPort.available() failed");
    }
    return JS_NewInt64(ctx, (int64_t)available);
}

JSValue js_uart_port_flush(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_uart_port_ref_t port_ref;
    esp32_mquickjs_uart_slot_t *slot = NULL;
    uint32_t timeout_ms;
    esp_err_t err;

    if (uart_get_bound_slot(ctx, *this_val, "UARTPort.flush()", &port_ref, &slot) != 0) {
        return JS_EXCEPTION;
    }
    timeout_ms = slot->timeout_ms;
    if (argc >= 1 && !JS_IsUndefined(argv[0]) && !js_value_to_u32(ctx, argv[0], &timeout_ms)) {
        return JS_ThrowTypeError(ctx, "UARTPort.flush(timeoutMs?) expects timeoutMs to be non-negative");
    }
    err = uart_wait_tx_done((uart_port_t)slot->port_id, uart_timeout_ticks(timeout_ms));
    if (err != ESP_OK) {
        return uart_throw_error(ctx, err, "UARTPort.flush() failed");
    }
    return JS_TRUE;
}

JSValue js_uart_port_clear_rx(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_uart_port_ref_t port_ref;
    esp32_mquickjs_uart_slot_t *slot = NULL;
    esp_err_t err;

    (void)argc;
    (void)argv;

    if (uart_get_bound_slot(ctx, *this_val, "UARTPort.clearRx()", &port_ref, &slot) != 0) {
        return JS_EXCEPTION;
    }
    err = uart_flush_input((uart_port_t)slot->port_id);
    if (err != ESP_OK) {
        return uart_throw_error(ctx, err, "UARTPort.clearRx() failed");
    }
    return JS_TRUE;
}

